# AnalysisType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..AnalysisType Property
EnergyDataSettings Class See Also
---
The type of analysis mode.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisMode AnalysisType { get; set; }
```

Visual Basic
---
```text
Public Property AnalysisType As AnalysisMode
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisMode AnalysisType {
	AnalysisMode get ();
	void set (AnalysisMode value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The analysis type does not fall within an appropriate range. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace